In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings ('ignore')

In [7]:
df=pd.read_excel('flight_price.xlsx')

In [8]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [10]:
df.describe()

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

In [12]:
df['date']=df['Date_of_Journey'].str.split('/').str[0]
df['month']=df['Date_of_Journey'].str.split('/').str[1]
df['year']=df['Date_of_Journey'].str.split('/').str[2]

In [20]:
df_copy=df.copy()
df_copy['date']=df_copy['date'].astype(int)
df_copy['month']=df_copy['month'].astype(int)
df_copy['year']=df_copy['year'].astype(int)

In [21]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
 11  date             10683 non-null  int64
 12  month            10683 non-null  int64
 13  year             10683 non-null  int64
dtypes: int64(4), object(10)
memory usage: 1.1+ MB

In [23]:
df_copy.drop(['Date_of_Journey'],axis=1,inplace=True)

In [24]:
df_copy.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019

In [25]:
df_copy.drop(['Route'],axis=1,inplace=True)

In [29]:
df_copy['dep_hr']=df_copy['Dep_Time'].str.split(':').str[0]
df_copy['dep_min']=df_copy['Dep_Time'].str.split(':').str[1]
df_copy['dep_hr']=df_copy['dep_hr'].astype(int)
df_copy['dep_min']=df_copy['dep_min'].astype(int)

In [30]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Dep_Time         10683 non-null  object
 4   Arrival_Time     10683 non-null  object
 5   Duration         10683 non-null  object
 6   Total_Stops      10682 non-null  object
 7   Additional_Info  10683 non-null  object
 8   Price            10683 non-null  int64
 9   date             10683 non-null  int64
 10  month            10683 non-null  int64
 11  year             10683 non-null  int64
 12  dep_hr           10683 non-null  int64
 13  dep_min          10683 non-null  int64
dtypes: int64(6), object(8)
memory usage: 1.1+ MB

In [31]:
df_copy.drop(['Dep_Time'],axis=1,inplace=True)

In [32]:
df_copy['arrival_hr']=df_copy['Arrival_Time'].str.split(' ').str[0].str.split(':').str[0]
df_copy['arrival_min']=df_copy['Arrival_Time'].str.split(' ').str[0].str.split(':').str[1]
df_copy['arrival_min']=df_copy['arrival_min'].astype(int)
df_copy['arrival_hr']=df_copy['arrival_hr'].astype(int)

In [33]:
df_copy.drop(['Arrival_Time'],axis=1,inplace=True)

In [35]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Duration         10683 non-null  object
 4   Total_Stops      10682 non-null  object
 5   Additional_Info  10683 non-null  object
 6   Price            10683 non-null  int64
 7   date             10683 non-null  int64
 8   month            10683 non-null  int64
 9   year             10683 non-null  int64
 10  dep_hr           10683 non-null  int64
 11  dep_min          10683 non-null  int64
 12  arrival_hr       10683 non-null  int64
 13  arrival_min      10683 non-null  int64
dtypes: int64(8), object(6)
memory usage: 1.1+ MB

In [47]:
df_copy['duration_hr']=df_copy['Duration'].str.split(' ').str[0].str.split('h').str[0]
df_copy['duration_min']=df_copy['Duration'].str.split(' ').str[1].str.split('m').str[0]
df_copy['duration_hr']=df_copy['duration_hr'].astype(int)
df_copy['duration_min']=df_copy['duration_min'].astype(float)

In [40]:
df_copy[df_copy['Duration']=='5m']

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,date,month,year,dep_hr,dep_min,arrival_hr,arrival_min,duration_hr,duration_min
6474,Air India,Mumbai,Hyderabad,5m,2 stops,No info,17327,6,3,2019,16,50,16,55,5m,NaN

In [45]:
df_copy.drop(df_copy.index[6474],inplace=True)

In [48]:
df_copy.drop(['Duration'],axis=1,inplace=True)

In [60]:
df_copy['Total_Stops'].unique()

array([nan])

In [59]:
df_copy['Total_Stops'].mode()

Series([], Name: Total_Stops, dtype: float64)

In [66]:
## since mode of total_stops is one stop so we replaced nan value with 1 stop then did mapping
df_copy['Total_Stops']=df_copy['Total_Stops'].map({'non-stop':0,'2 stops':2,'1 stop':1,'3 stops':3,'4 stops':4,np.nan:1})

In [67]:
df_copy.head()

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,date,month,year,dep_hr,dep_min,arrival_hr,arrival_min,duration_hr,duration_min
0,IndiGo,Banglore,New Delhi,NaN,No info,3897,24,3,2019,22,20,1,10,2,50.0
1,Air India,Kolkata,Banglore,NaN,No info,7662,1,5,2019,5,50,13,15,7,25.0
2,Jet Airways,Delhi,Cochin,NaN,No info,13882,9,6,2019,9,25,4,25,19,NaN
3,IndiGo,Kolkata,Banglore,NaN,No info,6218,12,5,2019,18,5,23,30,5,25.0
4,IndiGo,Banglore,New Delhi,NaN,No info,13302,1,3,2019,16,50,21,35,4,45.0

In [63]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Source           10682 non-null  object
 2   Destination      10682 non-null  object
 3   Total_Stops      10682 non-null  int64
 4   Additional_Info  10682 non-null  object
 5   Price            10682 non-null  int64
 6   date             10682 non-null  int64
 7   month            10682 non-null  int64
 8   year             10682 non-null  int64
 9   dep_hr           10682 non-null  int64
 10  dep_min          10682 non-null  int64
 11  arrival_hr       10682 non-null  int64
 12  arrival_min      10682 non-null  int64
 13  duration_hr      10682 non-null  int64
 14  duration_min     9651 non-null   float64
dtypes: float64(1), int64(10), object(4)
memory usage: 1.3+ MB

In [64]:
df_copy['Total_Stops'].isnull().sum()

0

In [65]:
df_copy['Total_Stops']

0        1
1        1
2        1
3        1
4        1
        ..
10678    1
10679    1
10680    1
10681    1
10682    1
Name: Total_Stops, Length: 10682, dtype: int64